#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Reading...
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Read complete after 0s [id=5513332c6fd981f024d721f3a628d5e068f05bee]
data.aws_route53_zone.domain_zone: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
data.aws_route53_zone.domain_zone: Read complete after 1s [id=Z019756110G25DTYU8A62]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.acm_certificate.aws_acm_certificate.app will be created
  + resource "aws_acm_certificate" "app" {
      + arn                       = (known after apply)
      + domain_name               = "mulla.au"
      + domain_validation_options = [
          + {
              + domain_name           = "*.mulla.au"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "api.mulla.au"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "mulla.au"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.mulla.au",
          + "api.mulla.au",
          + "mulla.au",
        ]
      + tags                      = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all                  = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.acm_certificate.aws_acm_certificate_validation.app will be created
  + resource "aws_acm_certificate_validation" "app" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm_certificate.aws_route53_record.app["*.mulla.au"] will be created
  + resource "aws_route53_record" "app" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z019756110G25DTYU8A62"
    }

  # module.acm_certificate.aws_route53_record.app["api.mulla.au"] will be created
  + resource "aws_route53_record" "app" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z019756110G25DTYU8A62"
    }

  # module.acm_certificate.aws_route53_record.app["mulla.au"] will be created
  + resource "aws_route53_record" "app" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z019756110G25DTYU8A62"
    }

  # module.api.aws_api_gateway_account.api_cloudwatch_role will be created
  + resource "aws_api_gateway_account" "api_cloudwatch_role" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.api.aws_api_gateway_deployment.api_deploy will be created
  + resource "aws_api_gateway_deployment" "api_deploy" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.api.aws_api_gateway_method_settings.apigw_setting will be created
  + resource "aws_api_gateway_method_settings" "apigw_setting" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.api.aws_api_gateway_resource.contact will be created
  + resource "aws_api_gateway_resource" "contact" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "contact"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API for mulla-website in prod environment"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "mulla-website-prod"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.api.aws_api_gateway_stage.apigw_stage will be created
  + resource "aws_api_gateway_stage" "apigw_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.api.aws_cloudwatch_log_group.api_gateway_execution_logs will be created
  + resource "aws_cloudwatch_log_group" "api_gateway_execution_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.api.aws_iam_role.api_role will be created
  + resource "aws_iam_role" "api_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mulla-website-api-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.api.aws_iam_role.cloudwatch will be created
  + resource "aws_iam_role" "cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mulla-website-api-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.api.aws_iam_role_policy.cloudwatch will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "mulla-website-cloudwatch-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.cdn.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "mulla.au",
          + "www.mulla.au",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "cache for mulla-website website in prod environment"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_200"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all                       = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = (known after apply)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + target_origin_id         = "S3WebappOrigin"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "logs/cloudfront"
        }

      + ordered_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + path_pattern             = "/images/*"
          + target_origin_id         = "S3ImagesOrigin"
          + viewer_protocol_policy   = "redirect-to-https"

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + cached_methods           = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "acba4595-bd28-49b8-b9fe-13317c0390fa"
          + path_pattern             = "/api/*"
          + target_origin_id         = "APIOrigin"
          + viewer_protocol_policy   = "redirect-to-https"

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "APIOrigin"
          + origin_path         = "/production"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "S3ImagesOrigin"
          + origin_path              = "/images"
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "S3WebappOrigin"
          + origin_path              = "/website"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cdn.aws_cloudfront_function.remove_path will be created
  + resource "aws_cloudfront_function" "remove_path" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
                var request = event.request;
                request.uri = request.uri.replace(/^\/[^/]*\//, "/");
                return request;
            }
        EOT
      + comment         = "cloudfront function to remove path from url (e.g. 'api/')"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "remove-path"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # module.cdn.aws_cloudfront_origin_access_control.default will be created
  + resource "aws_cloudfront_origin_access_control" "default" {
      + description                       = "OAC to access s3 bucket website files"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "s3-bucket-access"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.cloudfront_waf.aws_wafv2_web_acl.web_acl will be created
  + resource "aws_wafv2_web_acl" "web_acl" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "AWS Managed Rules for WAF"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "mulla-website-prod-acl"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all    = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "mulla-website-rule-common"
          + priority = 1

          + override_action {
              + count {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "mulla-website-rule-common-metric"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "mulla-website-web-acl"
          + sampled_requests_enabled   = true
        }
    }

  # module.dns.aws_route53_record.ipv4 will be created
  + resource "aws_route53_record" "ipv4" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mulla.au"
      + type            = "A"
      + zone_id         = "Z019756110G25DTYU8A62"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.dns.aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + records         = [
          + "mulla.au",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z019756110G25DTYU8A62"
    }

  # module.lambda_layers.aws_s3_object.lambda_code_zip["utility_zip_file"] will be created
  + resource "aws_s3_object" "lambda_code_zip" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "d6d67cdcc6d0fc09521572b016f97b3e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambda_zip/layer/utility_zip_file"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../.tmp/utility_layer.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "mulla-website-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all                    = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_acl.website_acl will be created
  + resource "aws_s3_bucket_acl" "website_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_cors_configuration.cors will be created
  + resource "aws_s3_bucket_cors_configuration" "cors" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://mulla.au",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # module.s3_bucket.aws_s3_bucket_ownership_controls.website_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "website_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.website_block will be created
  + resource "aws_s3_bucket_public_access_block" "website_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_versioning.website_versioning will be created
  + resource "aws_s3_bucket_versioning" "website_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.website.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.website.data.aws_iam_policy_document.website_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "website_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "Allow cloudfront OAC to access S3"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.website.aws_s3_bucket_policy.access will be created
  + resource "aws_s3_bucket_policy" "access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.website.aws_s3_bucket_server_side_encryption_configuration.s3_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "s3_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.website.aws_s3_object.images["banner.png"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/banner.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/banner.png"
      + source_hash            = "dbadce6f5433e299f046a19d3fede51d"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["ehealth.png"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/ehealth.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/ehealth.png"
      + source_hash            = "9cb7c56cd35ff80ab9d013a953cbf4d6"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["iress.png"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/iress.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/iress.png"
      + source_hash            = "1dd7a78e64fe7e8f906b0357f2afdab7"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["portfolio.png"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/portfolio.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/portfolio.png"
      + source_hash            = "68b0cdcaa968a9c21573b52f3eae7945"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["rmit.jpg"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/rmit.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/rmit.jpg"
      + source_hash            = "904c6a4eba4c32dbaa12a3570c67e3f0"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["tarek-mulla.jpg"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/tarek-mulla.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/tarek-mulla.jpg"
      + source_hash            = "5683c5f6901fd4d9812e067c5fb54667"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["tbb.png"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/tbb.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/tbb.png"
      + source_hash            = "01b0897d05aef0a82a176405403c2886"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["telstra.png"] will be created
  + resource "aws_s3_object" "images" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/telstra.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/telstra.png"
      + source_hash            = "8768809d7cc15d3496a4ca97b9f49f8d"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["asset-manifest.json"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/asset-manifest.json"
      + source_hash            = "d37b85451fe75ea5c6f06222a556265a"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["favicon.ico"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/favicon.ico"
      + source_hash            = "be582f9421da6c48b4388266b10c5d1c"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["index.html"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/index.html"
      + source_hash            = "9681472eb419c1c3969eb5ad2382988d"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["manifest.json"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/manifest.json"
      + source_hash            = "2f717775d17bf3a581acf2903353545f"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["robots.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/robots.txt"
      + source_hash            = "fa1ded1ed7c11438a9b0385b1e112850"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/css/main.ee269497.css"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/css/main.ee269497.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/css/main.ee269497.css"
      + source_hash            = "bb5017d0777af0f3af82ce7b4f99e0d7"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/css/main.ee269497.css.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/css/main.ee269497.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/css/main.ee269497.css.map"
      + source_hash            = "237b45f4997f1fa3557e8d9af0fa22bb"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/496.ae11a27b.chunk.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/496.ae11a27b.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/496.ae11a27b.chunk.js"
      + source_hash            = "62cc911b1515f5c2bb6822fcd45ca997"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/496.ae11a27b.chunk.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/496.ae11a27b.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/496.ae11a27b.chunk.js.map"
      + source_hash            = "43fffdf68875b8df6d71d769c757cc12"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.3dde24d8.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.3dde24d8.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.3dde24d8.js"
      + source_hash            = "092913e3aff7f08a5b47d2869c362e8d"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.3dde24d8.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.3dde24d8.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.3dde24d8.js.LICENSE.txt"
      + source_hash            = "d82f02efc3c438bb23780f8a2d4af104"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.3dde24d8.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.3dde24d8.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.3dde24d8.js.map"
      + source_hash            = "b8fda6d3121f8a6ca7ba1b4cc0edd17a"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.api.module.contact.data.archive_file.lambda_source_package will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_source_package" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./../.tmp/contact.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/api/contact/src/"
      + type                = "zip"
    }

  # module.api.module.contact.aws_api_gateway_integration.contact_lambda_integration will be created
  + resource "aws_api_gateway_integration" "contact_lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.module.contact.aws_api_gateway_method.contact will be created
  + resource "aws_api_gateway_method" "contact" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.module.contact.aws_lambda_permission.lambda_permession will be created
  + resource "aws_lambda_permission" "lambda_permession" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "mulla-website-prod-contact"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.module.contact.aws_s3_object.lambda_code_zip will be created
  + resource "aws_s3_object" "lambda_code_zip" {
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambda_zip/function/contact"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../.tmp/contact.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.lambda_layers.module.lambda_layer["utility_zip_file"].aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs16.x",
        ]
      + created_date                = (known after apply)
      + description                 = "A lambda layer for utility methods shared with all lambda functions"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "mulla-website-prod-utility"
      + s3_bucket                   = (known after apply)
      + s3_key                      = (known after apply)
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ses:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "ses"
        }
    }

  # module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.api.module.contact.module.contact_lambda.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.api.module.contact.module.contact_lambda.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.api.module.contact.module.contact_lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/mulla-website-prod-contact"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all          = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
    }

  # module.api.module.contact.module.contact_lambda.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "mulla-website-prod-contact-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all    = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
    }

  # module.api.module.contact.module.contact_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "mulla-website-prod-contact-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all    = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
    }

  # module.api.module.contact.module.contact_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mulla-website-prod-contact"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all              = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + unique_id             = (known after apply)
    }

  # module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "mulla-website-prod-contact"
    }

  # module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "mulla-website-prod-contact"
    }

  # module.api.module.contact.module.contact_lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "lambda function to send an email when receive contact message"
      + function_name                  = "mulla-website-prod-contact"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + tags_all                       = {
          + "Application" = "mulla-website"
          + "Created_By"  = "Terraform"
          + "Description" = "Portflio to show achievments and personal details"
          + "Environment" = "prod"
          + "Name"        = "mulla-website-prod"
          + "Repository"  = "https://github.com/tarekmulla/mulla-website"
          + "Type"        = "Personal"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "APP"    = "mulla-website"
              + "DOMAIN" = "mulla.au"
            }
        }

      + ephemeral_storage {
          + size = 512
        }
    }

Plan: 62 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Plan`*